﻿main();

function main(){
	//Make certain that user interaction (display of dialogs, etc.) is turned on.
	app.scriptPreferences.userInteractionLevel = UserInteractionLevels.interactWithAll;
	if(app.documents.length != 0){
		if(app.selection.length > 0){
            if(app.selection[0].length > 0){
				var str = getUnicode(app.selection[0].contents);
                  app.selection[0].contents = str;
				  doSearchReplace("्ा", "");
				  doSearchReplace("इ(rf)", "ई");
				  doSearchReplace("़्", "़्");
				  /*doSearchReplace("(\(in\))([ક-હ](્[ક-હ])?(્[ક-હ])?)", "$2િ");
				  doSearchReplace("([ક-હ](્[ક-હ])?(્[ક-હ])?)(?=\(rf\))", "ર્$1");
				  doSearchReplace("(\(in\))(.્.)(?!્)", "$2િ");*/
			}
		    else{
			     alert("Please select text (or a text frame) and try again.");
			}
		}
		else{
			alert("Please select text (or a text frame) and try again.");
		}
	}
	else{
		alert("No documents are open. Please open a document and try again.");
	}
}

function doSearchReplace(findStr, repStr){
	//Clear the find/change text preferences.
	app.findTextPreferences = NothingEnum.nothing;
	app.changeTextPreferences = NothingEnum.nothing;
	
	app.findTextPreferences.findWhat = findStr; 
	app.changeTextPreferences.changeTo = repStr; 
	app.documents[0].changeText();
	//Clear the find/change text preferences after the search.
	app.findTextPreferences = NothingEnum.nothing;
	app.changeTextPreferences = NothingEnum.nothing;
}

function getUnicode(myString)
{

var myTable = {  
"9": "\t",
"10": "\n",
"13": "\r", 
"32": " ",  
"33": "!",
"35": "प्त",
"36": ".",
"37": "त्न",
"40": "(",
"41": ")",
"43": "+",
"44": ",",
"45": "-",
"46": ".",
"48": "0",
"49": "1",
"50": "2",
"51": "3",
"52": "4",
"53": "5",
"54": "6",
"55": "7",
"56": "8",
"57": "9",
"58": ":",
"59": ";",
"60": "‚",
"61": "²",
"62": "(62)",
"63": "?",
"67": "ष्ट",
"68": "ष्ठ",
"69": "श्व",
"70": "स्न",
"71": "त्र",
"72": "।।",
"73": "ढ्ढ",
"74": "छ्व",
"75": "्य",
"76": "रु",
"77": "रू",
"78": "हृ",
"80": "क्क",
"82": "त्र्क",
"83": "स्",
"90": "(rf)ं",
"92": "झ्र",
"94": "ट्ट",
"95": "ट्ठ",
"97": "ड्ड",
"98": "ड्ढ",
"99": "ष्",
"100": "स्र",
"101": "द्ग",
"102": "द्ध",
"103": "द्द",
"104": "द्ध",
"105": "द्ब",
"106": "द्भ",
"107": "द्म",
"108": "द्य",
"109": "द्व",
"110": "ठ्ठ",
"112": "श्च",
"113": "ह्न",
"114": "ह्म",
"115": "ह्य",
"117": "ह्व",
"128": "क्",
"129": "ख्",
"130": "ग्",
"131": "घ्",
"132": "ल्ल",
"133": "ज्",
"134": "ञ्",
"135": "ण्",
"136": "त्",
"137": "थ्",
"138": "ध्",
"139": "न्",
"140": "प्",
"141": "फ्",
"381": "ब्",
"143": "भ्",
"144": "म्",
"145": "च्",
"146": "ज्",
"147": "च्च",
"151": "—",
"152": "त्र्",
"153": "ज्ञ्",
"157": "स्त्र",
"158": "त्त्",
"159": "श्र्",
"161": "ँ",
"162": "ं",
"165": "अ",
"167": "इ",
"168": "(inn)",
"169": "उ",
"170": "ऊ",
"171": "ऋ",
"173": "लृ",
"175": "ख्र",
"178": "दृ",
"180": "ं",
"182": "ल",
"183": "क",
"185": "ख",
"186": "ख्र",
"187": "ग",
"188": "द",
"189": "ड्ट",
"190": "ङ",
"191": "च",
"192": "छ",
"193": "ज",
"194": "प",
"195": "व्",
"196": "य्",
"197": "ट",
"198": "ठ",
"199": "ड",
"200": "फ",
"201": "ढ",
"203": "ल्",
"204": "त",
"205": "थ",
"206": "द",
"207": "ध",
"208": "।",
"213": "ब",
"214": "भ",
"215": "म",
"216": "य",
"217": "न",
"218": "र",
"219": "झ्",
"220": "ल",
"221": "ळ",
"223": "व",
"224": "श्",
"225": "ष्",
"226": "स",
"227": "ह",
"228": "ु",
"229": "ू",
"230": "ा",
"231": "(in)",
"232": "ी",
"233": "ु",
"234": "ू",
"235": "ृ",
"240": "े",
"241": "ै",
"243": "न्न्",
"244": "ो",
"245": "ौ",
"247": "्",
"249": "ढ्ढ",
"250": "ॐ",
"252": "(rf)",
"253": "्र",
"254": "्र",
"255": "क्ष्",
"65279": "",
"85": "",
"164": "",
"8225": "ण्",
"338": "प्",
"118": "1",
"119": "2",
"120": "3",
"121": "4",
"122": "5",
"123": "6",
"124": "7",
"125": "8",
"126": "9",
"174": "0",
"184": "़",
"8249": "न्",
"710": "त्",
"202": "ज़्",
"176": "ए",
"352": "ध्",
"8212": "—",
"210": "‘",
"211": "’",
"239": "",
"402": "घ्",
"376": "श्र्",
"8482": "ज्ञ्",
"732": "त्र्",
"8440": "थ्",
"8364": "क्",
"8216": "च्",
"209": "ः",
"8218": "ग्",
"8240": "थ्",
"8230": "ज्",
"242": "ॅ",




     };
    
    
    var newStr = "";
    
    for(var i = 0; i < myString.length; i++)
    { 
        var c = myString.charCodeAt(i); 
        //alert(c);
        if(c in myTable)
        {
            newStr += myTable[c];
        }
        else
        {
            newStr += "(" + c + ")";
        }
    }
return newStr;
}
